'''
다음이 설명하고 있는 데이터 수집 기술은 무엇인가?
인터넷상에서 제공되는 다양한 웹 사이트로부터 소셜 네트워크
정보, 뉴스, 게시판 등의 웹 문서 및 콘텐츠 수집 기술
'''
#크롤링 Crawling
'''
다음이 설명하고 있는 데이터는 무엇인가?
자료 그자체가 아닌 자료의 속성 등을 설명하는 데이터이다.
대표적으로 데이터에 관한 정보의 기술, 데이터 구성의 정의,
데이터 분류 등을 위한 데이터 등이 있다.
'''
##메타데이터 Metadata
'''
차원이 증가할수록 데이터의 분포 분석 또는 모델 추정에 필요한
샘플 데이터의 개수가 기하급수적으로 증가하게 되는 현상은 무엇인가?
'''
##차원의 저주 Curse of Dimensionality
'''
다음 괄호(____) 안에 들어갈 가장 알맞은 기법을 쓰시오.
(____)은/는 모형을 세운 뒤 관찰 가능한 데이터르르 이용하여
해당 잠재 요인을 도출하고 데이터 안의 구조를 해석하는 기법이다.
(____)은/는 데이터 안에 관찰할 수 없는 잠재적인 변수
(Latent Variable)가 존재한다고 가정한다.
'''
##요인 분석 Factor Analysis
'''
다음이 설명하는 의사결정나무 알고리즘은 무엇인가?
각 독립변수를 이분화하는 과정을 반복하여 이진 트리 형태를
형성함으로써 분류를 수행하는 알고리즘이다.
가장 성취도가 좋은 변수 및 수준을 찾는 것에 중점을 둔다.
개별 입력변수뿐만 아니라 독립변수들의 선형 결합중에서
최적의 분리를 구할 수 있다.
'''
##ClassificationAndRegressionTree
'''
다음 괄호 (____)안에 들어갈 가장 정확한 용어를 쓰시오.
(____)은/는 평균 대치법에서 관측된 자료를 토대로 추정된 통계량으로
결측값을 대치할 때 어떤 적절한 확률값을 부여한 후 대치하는 방법이다.
(____)의 종류에는 핫덱 대체, 골트덱 대체, 혼합방법이 있다.
'''
##단순 확률 대치법 Single Stochastic Imputation
'''
다음은 데이터 시각화에 대한 설명이다. 괄호 (____)안에 들어갈 용어를 쓰시오.
(____)은/는 분류에 따른 변화를 최대, 최소, 전체 분포등으로 구분하는
전체에서 부분 간 관계를 설명한다.
(____)에는 파이 차트. 도넛 차트. 트리맵, 누적 영역 차트가 있다.
'''
##분포 시각화
'''
잔차의 분산이 독립변수와 무관하게 일정해야 한다는 특성은 무었인가?
'''
##등분산성
'''
모형을 가장 많이 향상시키는 변수를 하나씩 점진적으로 추가하는 전진 선택과
모두 포함된 상태에서 시작하며 가장 적은 영향을 주는 변수부터
하나씩 제거하는 후진 소거를 함께 사용하는 방법은 무엇인가?
'''
##단계별 선택법 Stepwise Slection
'''
다음은 k-평균 군집의 k값 선정 기법에 대한 설명이다.
(____)안에 알맞은 기법을 쓰시오.
(____)은/는 클러스터 내 오차제곱합이 최소가 되도록 클러스터의 중심을
결정해 나가는 방법이다.
(____)은/는 클러스터 개수를 늘렸을 때 중심 간의 평균 거리가 더 이상
많이 감소하지 않는 경우의 k를 선택한다.
'''
##엘보우 기법 Elbow
