'''
주로 마케팅에 활용되는 기법으로 고객 구매 데이터를 분석하여 어떠한 상품이
또 다른 어떠한 상품과 함께 판매될 확률이 높은가를 보여주는 연관규칙을
도출하는 기법은 무엇인가?
'''
##연과규칙분석   장바구니 분석
'''
괄호 (____)안에 공통적으로 들어갈 알맞은 용어를 쓰시오.
(____)은/는 모델 내부에서 확인이 가능한 변수로 데이터를 통해서 산출이 가능한 값이다.
(____)은/는 측정되거나 데이터로부터 학습되고, 주로 사람에 의해 수작업으로 측정되지 않는다.
'''
##매개변수 Parameter
'''
다음 괄호 (____) 안에 들어갈 가장 알맞은 용어를 쓰시오.
(____)은/는 정답인 레이블(Label)이 포함되어 있는 훈련 데이터와
레이블(Label)이 없는 훈련 데이터를 모두 훈련에 사용하는 학습 방법이다.
레이블이 일부만 있어도 데이터를 다룰 수 있다.
일반적으로 정답인 레이블이 포함된 훈련 데이터가 적고 정답인 레이블이 없는
훈련 데이터를 많이 갖고 있다.
'''
##준지도 학습
'''
다음 괄호 (____)안에 들어갈 용어를 쓰시오.
(____)은/는 정형, 반정형, 비정형 데이터를 비롯한 모든 가공되지않은 다양한 종류의
데이터(Raw data)를 저장할 수 있는 시스템 또는 중앙 집중식 데이터 저장소이다.
'''
##데이터 레이크 Data Lake
'''
괄호 (____) 안에 들어갈 가장 알맞은 용어를 쓰시오.
(____)은/는 웹상에 존재하는 데이터를 개별 URI(Uniform Resource Identifier)로 식별하고,
각 URI에 링크 정보를 부여함으로써 상호 연결된 웹을 지향하는 오픈 데이터이다.
'''
##LinkedOpenData
'''
다음은 데이터 수집 기술에 대한 설명이다. 괄호 (____)안에 들어갈 가장 알맞은 용어를 쓰시오.
(____)은/는 데이터 분석을 위한 데이터를 데이터 저장소인 DW(Data Warehouse) 및
DM(Data Mart)으로 이동시키기 위해 다양한 소스 시스템으로부터 필요한 원본 데이터를
추출(Extract)하고 변환(Transfrom-변화, 정제)하는 기술이다.
'''
##ExtractTransformLoad
'''
K개 소집단의 중심 좌표를 이용하여 각 객체와 중심좌표 간의 거리를 산출하고,
가장 근접한 소집단에 배정한 후 해당 소집단의 중심좌표를 업데이트하는 방식으로
군집화 하는 방식은 무엇인가?
'''
##K평균군집화
'''
다음 괄호 (____)안에 들어갈 가장 알맞은 기법을 쓰시오.
(____)은/는 데이터 분석의 목적으로 수집된 데이터를 확률.통계적으로 정리.요약하는
기초적인 통계방법이다.
평균, 분산, 표준편차,왜도와 첨도, 빈도 등 데이터에 대한
대략적인 통계적 수치를 계산하고 도출한다.
'''
##기술 통계 Descriptive Statistics
'''
다음은 데이터 품질 검증 기법에 대한 설명이다. 괄호 (____)안에 들어갈 알맞은 용어를 쓰시오.
(____)은/는 데이터 현황 분석을 위한 자료 수집을 통해 잠재적 오류 징후를 발견하는 방법이다.
(____)은/는 데이터의 저장, 연계, 가공, 활용 등 데이터의 변경이 발생하는 모든 영역에서
수행하여 오류를 사전에 파악할 수 있다.
'''
##데이터 프로파일링 Data Profiling
'''
불군형 데이터 처리를 위해 서로 같거나 서로 다른 여러 가지 모형들의 예측/분류 결과를 종합하여
최종적인 의사 결정에 활용하는 기법은 무엇인가?
'''
##앙상블 기법 Ensemble Thchnique
