'''
데이터 백업이나 통합 작업을 할 경우 최근 변경된 데이터들을 다른 시스템으로
이동하는 처리 기술은 무엇인가?
'''
##ChangeDataCapture
'''
다음이 설염하는 가장 알맞은 학습 방법을 쓰시오.
선택 가능한 행동 중 보상을 최대한하는 행동 혹은 행동 순서를 선택하는
학습방법이다.'컴퓨터가 선택한 행동(Action)에 대한 반응에 따라 보상(reward)이
주어진다.
행동의 결과로 나마나는 보상을 통하여 학습을 진행한다.
'''
##강화학습 Rainforcement Learning
'''
기울기 방향으로 힘을 받으면 물체가 가속된다는 물리 법칙을 적용한 알고리즘으로,
관성의 방향을 고려해 진동과 폭을 중이는 효과가 있고, 탐색 병로의 변위가 줄어들어
빠르게 최적점으로 수렴하는 특성을 가진 알고리즘은 무엇인가?
'''
##모멘텀 Momentum
'''
개체들 사이의 유사성, 비유사성을 측정하여 2차원 또는 3차원 공간상에 점으로
표현하여 개체들 사이의 집단화를 시각적으로 표현하는 분석방법은 무엇인가?
'''
##다차원 척도법 Multi-Dimentional Scaling
'''
의사결정나무를 개별 모형으로 사용하는 모형 결합 방법으로, 모든 독립변수를 비교하여
최선의독립변수를 선택하는 것이 아니라 독립변수를 비교하여 최선의 독립변수를
선택하는 것이 아니라 독립변수 차원을 랜덤하게 감소시킨 다음
그중에서 독립변수를 선택하는 방법은 무엇인가.
'''
##랜덤포레스트 RandomForest
'''
다음은 개인정보 처리 기술에 대한 설명이다. 괄호(____)안에 들어갈 용어를 쓰시오.
(____)은/는 특정 개인을 식별할 수 없도록 개인 정보의 일부 또는 전부를 변환하는 일련의 방법이다.
'''
##데이터 비식별화 Data Deidentification
'''
다음은 변수 선택/ 기법에 대한 설명이다. 괄호 (____) 안에 알맞은 기법을 쓰시오.
(____)은/는 모델 자체에 변수 선택이 포함된 기법이다.
(____)의 사례로는 라쏘, 릿지, 엘라스틱 넷, SelectFromModel 등이 있다.
'''
##임베디드 기법 Embedded Method
'''
프라이버시 보호 모겔에서 주어진 데이터 집합에서 같은 값이 적어도 k개 이상 존재하도록 하여
쉽게 다른 정보로 결합할 수 없도록 하는 모델은 무엇인가?
'''
##k-익명성 k-Anonymity
'''
괄호 (____)안에 들어갈 가장 알맞은 용어를 쓰시오.
(____)은/는 개체들의 밀도(Density) 계산을 기반으로 밀접하게 분포된 개체들끼리 그룹팅하는
알고리즘이다.
클러스터의 개수를 미리 지정할 필요가 없고, 군집밀도에 따라서 군집을 서로 연결하기 떄문에
기하학적인 모양의 군집 분석이 가능하다.
중심점, 이웃점, 경계점, 잡음점 등으로 구분된다.
'''
##Dendity-Based Spatial Clustering Application with Noise 알고리즘
'''
다음 괄호 (____)안에 들어갈 가장 알맞은 용어를 쓰시오.
(____)은/는 분류 모형의 성능을 평가하기 위해서 사용되는 그래프 분석 방법이다.
(____)은/는 이익 곡선(Gain Curve), 리프트 곡선(Lift Curve)이라고도 부른다.
'''
##이익 도표 Gain Chart
